In [2]:
import numpy as np
import pandas as pd

In [11]:
data = np.random.randn(3,4)

In [12]:
data

array([[ 1.49289294e+00,  6.15812662e-01,  1.32653707e-01,
         6.40093106e-01],
       [ 2.79077180e-02, -9.94670026e-04,  1.42710171e+00,
        -2.72861861e-01],
       [ 1.14124052e-01, -1.32606998e+00,  1.12069066e+00,
         3.89720949e-01]])

In [13]:
ilkFrame = pd.DataFrame(data)

In [14]:
ilkFrame

          0         1         2         3
0  1.492893  0.615813  0.132654  0.640093
1  0.027908 -0.000995  1.427102 -0.272862
2  0.114124 -1.326070  1.120691  0.389721

In [15]:
yeniFrame = pd.DataFrame(data, index=["Tolga","Furkan","Kılınç"],columns=["Yaş", "Şehir","Mail","Araç"])

In [16]:
yeniFrame

             Yaş     Şehir      Mail      Araç
Tolga   1.492893  0.615813  0.132654  0.640093
Furkan  0.027908 -0.000995  1.427102 -0.272862
Kılınç  0.114124 -1.326070  1.120691  0.389721

In [19]:
yeniFrame.loc["Tolga"]

Yaş      1.492893
Şehir    0.615813
Mail     0.132654
Araç     0.640093
Name: Tolga, dtype: float64

In [20]:
yeniFrame("Yaş")

TypeError: 'DataFrame' object is not callable

In [21]:
yeniFrame["Yaş"]

Tolga     1.492893
Furkan    0.027908
Kılınç    0.114124
Name: Yaş, dtype: float64

In [22]:
yeniFrame.iloc[0]

Yaş      1.492893
Şehir    0.615813
Mail     0.132654
Araç     0.640093
Name: Tolga, dtype: float64

In [23]:
yeniFrame["Borç"] = yeniFrame["Araç"] + yeniFrame["Şehir"]

In [24]:
yeniFrame

             Yaş     Şehir      Mail      Araç      Borç
Tolga   1.492893  0.615813  0.132654  0.640093  1.255906
Furkan  0.027908 -0.000995  1.427102 -0.272862 -0.273857
Kılınç  0.114124 -1.326070  1.120691  0.389721 -0.936349

In [25]:
yeniFrame

             Yaş     Şehir      Mail      Araç      Borç
Tolga   1.492893  0.615813  0.132654  0.640093  1.255906
Furkan  0.027908 -0.000995  1.427102 -0.272862 -0.273857
Kılınç  0.114124 -1.326070  1.120691  0.389721 -0.936349

In [30]:
yeniFrame.drop("Mail",axis= 1)

             Yaş     Şehir      Araç      Borç
Tolga   1.492893  0.615813  0.640093  1.255906
Furkan  0.027908 -0.000995 -0.272862 -0.273857
Kılınç  0.114124 -1.326070  0.389721 -0.936349

In [31]:
yeniFrame

             Yaş     Şehir      Mail      Araç      Borç
Tolga   1.492893  0.615813  0.132654  0.640093  1.255906
Furkan  0.027908 -0.000995  1.427102 -0.272862 -0.273857
Kılınç  0.114124 -1.326070  1.120691  0.389721 -0.936349

In [32]:
yeniFrame.drop("Mail",axis=1,inplace=True)

In [33]:
yeniFrame

             Yaş     Şehir      Araç      Borç
Tolga   1.492893  0.615813  0.640093  1.255906
Furkan  0.027908 -0.000995 -0.272862 -0.273857
Kılınç  0.114124 -1.326070  0.389721 -0.936349

In [35]:
yeniFrame.loc["Tolga"]["Yaş"]

1.4928929445861245

In [36]:
yeniFrame < 0

          Yaş  Şehir   Araç   Borç
Tolga   False  False  False  False
Furkan  False   True   True   True
Kılınç  False   True  False   True

In [38]:
yeniFrame[yeniFrame > 0]

             Yaş     Şehir      Araç      Borç
Tolga   1.492893  0.615813  0.640093  1.255906
Furkan  0.027908       NaN       NaN       NaN
Kılınç  0.114124       NaN  0.389721       NaN

In [42]:
yeniFrame[yeniFrame["Yaş"] < 1]

             Yaş     Şehir      Araç      Borç
Furkan  0.027908 -0.000995 -0.272862 -0.273857
Kılınç  0.114124 -1.326070  0.389721 -0.936349

In [44]:
yeniFrame.reset_index(inplace=True)

In [45]:
yeniFrame

    index       Yaş     Şehir      Araç      Borç
0   Tolga  1.492893  0.615813  0.640093  1.255906
1  Furkan  0.027908 -0.000995 -0.272862 -0.273857
2  Kılınç  0.114124 -1.326070  0.389721 -0.936349